
Процедура ОбработкаПроведения(Отказ, Режим)

	 Попытка

    Движения.ОстаткиОборудования.Записывать = Истина;

    Для Каждого Стр Из Оборудование Цикл

        Если Стр.ИнвентарныйОбъект = Неопределено Тогда
            ВызватьИсключение "Не выбран инвентарный объект!";
        КонецЕсли;

        // --- Остатки ---
        Запрос = Новый Запрос;
        Запрос.Текст =
        "ВЫБРАТЬ
        |   Остатки.КоличествоОстаток КАК Количество,
        |   Остатки.Подразделение,
        |   Остатки.Сотрудник
        |ИЗ
        |   РегистрНакопления.ОстаткиОборудования.Остатки(
        |       ,
        |       ИнвентарныйОбъект = &Объект) КАК Остатки";

        Запрос.УстановитьПараметр("Объект", Стр.ИнвентарныйОбъект);

        Выборка = Запрос.Выполнить().Выбрать();

        Если НЕ Выборка.Следующий() Тогда
            ВызватьИсключение "Объект отсутствует на остатках!";
        КонецЕсли;

        Если Выборка.Количество <= 0 Тогда
            ВызватьИсключение "Объект уже списан!";
        КонецЕсли;

        // --- движение ---
        Движение = Движения.ОстаткиОборудования.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;
        Движение.ИнвентарныйОбъект = Стр.ИнвентарныйОбъект;
        Движение.Номенклатура = Стр.ИнвентарныйОбъект.Номенклатура;
        Движение.Подразделение = Выборка.Подразделение;
        Движение.Сотрудник = Выборка.Сотрудник;
        Движение.Количество = 1;

        // --- статус ---
        ОбъектОборудования = Стр.ИнвентарныйОбъект.ПолучитьОбъект();
        ОбъектОборудования.Статус =
            Перечисления.СтатусОборудования.Списано;
        ОбъектОборудования.Записать();

    КонецЦикла;

Исключение
    Отказ = Истина;
    Сообщить("Ошибка списания: " + ОписаниеОшибки());
КонецПопытки;




КонецПроцедуры
