Процедура ОбработкаПроведения(Отказ, Режим)

	Попытка
		
		
        Движения.ОстаткиОборудования.Записывать = Истина;

        Для Каждого Строка Из Оборудование Цикл

            // 1️⃣ Проверка объекта
            Если Строка.ИнвентарныйОбъект = Неопределено Тогда
                ВызватьИсключение "Не выбран инвентарный объект!";
            КонецЕсли;

            // Получаем объект
            Объект = Строка.ИнвентарныйОбъект.ПолучитьОбъект();

            Если Объект.Номенклатура = Неопределено Тогда
                ВызватьИсключение 
                "У инвентарного объекта не заполнена номенклатура!";
            КонецЕсли;

            // 2️⃣ Расход
            ДвижениеРасход = Движения.ОстаткиОборудования.Добавить();
            ДвижениеРасход.ВидДвижения = ВидДвиженияНакопления.Расход;
            ДвижениеРасход.Период = Дата;
            ДвижениеРасход.ИнвентарныйОбъект = Строка.ИнвентарныйОбъект;
            ДвижениеРасход.Номенклатура = Объект.Номенклатура;
            ДвижениеРасход.Подразделение = ПодразделениеОт;
            ДвижениеРасход.Сотрудник = СотрудникОт;
            ДвижениеРасход.Количество = 1;

            // 3️⃣ Приход
            ДвижениеПриход = Движения.ОстаткиОборудования.Добавить();
            ДвижениеПриход.ВидДвижения = ВидДвиженияНакопления.Приход;
            ДвижениеПриход.Период = Дата;
            ДвижениеПриход.ИнвентарныйОбъект = Строка.ИнвентарныйОбъект;
            ДвижениеПриход.Номенклатура = Объект.Номенклатура;
            ДвижениеПриход.Подразделение = ПодразделениеКому;
            ДвижениеПриход.Сотрудник = СотрудникКому;
            ДвижениеПриход.Количество = 1;

            // 4️⃣ Обновляем статус
            Объект.Статус = Перечисления.СтатусОборудования.ВЭксплуатации;
            Объект.Записать();

        КонецЦикла;

    Исключение
        Отказ = Истина;
        Сообщить("Ошибка проведения: " + ОписаниеОшибки());
    КонецПопытки;
	
КонецПроцедуры

