&НаКлиенте
Процедура ОткрытьИнвентарныеОбъекты(Команда)
    ОткрытьФорму("Справочник.ИнвентарныеОбъекты.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоступление(Команда)
    ОткрытьФорму("Документ.ПоступлениеОборудования.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПередачу(Команда)
    ОткрытьФорму("Документ.ПередачаОборудования.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСписание(Команда)
    ОткрытьФорму("Документ.СписаниеОборудования.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПоставщики(Команда)
    ОткрытьФорму("Справочник.Поставщики.ФормаСписка");
КонецПроцедуры
